; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image2 - mode
	spectrograph1 - mode
	infrared0 - mode
	Star0 - direction
	Star1 - direction
	Star5 - direction
	Star4 - direction
	Star3 - direction
	GroundStation2 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite1 Planet11)
	(have_image Planet6 spectrograph1)
	(have_image Phenomenon7 spectrograph1)
	(have_image Phenomenon8 infrared0)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 image2)
	(have_image Planet11 image2)
	(have_image Planet12 infrared0)
	(have_image Star13 spectrograph1)
	(have_image Planet14 image2)
	(have_image Star15 image2)
	(have_image Planet16 infrared0)
	(have_image Phenomenon17 infrared0)
))

)

; plan
1. (turn_to satellite1 planet11 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet11)
   goals met: 1 of 13
2. (turn_to satellite0 star3 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star3)
   goals met: 1 of 13
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 13
4. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 1 of 13
5. (turn_to satellite0 phenomenon8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 13
6. (take_image satellite0 phenomenon8 instrument1 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 2 of 13
7. (turn_to satellite0 phenomenon17 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 13
8. (take_image satellite0 phenomenon17 instrument1 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 3 of 13
9. (turn_to satellite0 phenomenon10 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 13
10. (take_image satellite0 phenomenon10 instrument1 image2)
   added: (have_image phenomenon10 image2)
   goals met: 4 of 13
11. (turn_to satellite0 planet11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet11)
   goals met: 4 of 13
12. (take_image satellite0 planet11 instrument1 image2)
   added: (have_image planet11 image2)
   goals met: 5 of 13
13. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 5 of 13
14. (take_image satellite0 planet12 instrument1 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 6 of 13
15. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 6 of 13
16. (take_image satellite0 planet14 instrument1 image2)
   added: (have_image planet14 image2)
   goals met: 7 of 13
17. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 7 of 13
18. (take_image satellite0 planet16 instrument1 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 8 of 13
19. (turn_to satellite0 star15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star15)
   goals met: 8 of 13
20. (take_image satellite0 star15 instrument1 image2)
   added: (have_image star15 image2)
   goals met: 9 of 13
21. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 9 of 13
22. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 9 of 13
23. (turn_to satellite0 star5 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star5)
   goals met: 9 of 13
24. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 9 of 13
25. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   goals met: 9 of 13
26. (take_image satellite0 phenomenon7 instrument0 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 10 of 13
27. (turn_to satellite0 planet6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet6)
   goals met: 10 of 13
28. (take_image satellite0 planet6 instrument0 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 11 of 13
29. (turn_to satellite0 star13 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star13)
   goals met: 11 of 13
30. (take_image satellite0 star13 instrument0 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 12 of 13
31. (turn_to satellite0 star9 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star9)
   goals met: 12 of 13
32. (take_image satellite0 star9 instrument0 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 13 of 13
